RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/templates/COMPONENT_MBED/COMPONENT_CM4/TOOLCHAIN_IAR/startup_psoc6_04_cm4.S
        PUBWEAK tcpwm_0_interrupts_256_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_256_IRQHandler
        B       tcpwm_0_interrupts_256_IRQHandler

        PUBWEAK tcpwm_0_interrupts_257_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_257_IRQHandler
        B       tcpwm_0_interrupts_257_IRQHandler

        PUBWEAK tcpwm_0_interrupts_258_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_258_IRQHandler
        B       tcpwm_0_interrupts_258_IRQHandler

        PUBWEAK tcpwm_0_interrupts_259_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_259_IRQHandler
        B       tcpwm_0_interrupts_259_IRQHandler

        PUBWEAK tcpwm_0_interrupts_260_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_260_IRQHandler
        B       tcpwm_0_interrupts_260_IRQHandler

        PUBWEAK tcpwm_0_interrupts_261_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_261_IRQHandler
        B       tcpwm_0_interrupts_261_IRQHandler

        PUBWEAK tcpwm_0_interrupts_262_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_262_IRQHandler
        B       tcpwm_0_interrupts_262_IRQHandler

        PUBWEAK tcpwm_0_interrupts_263_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
tcpwm_0_interrupts_263_IRQHandler
        B       tcpwm_0_interrupts_263_IRQHandler

        PUBWEAK pass_interrupt_dacs_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
pass_interrupt_dacs_IRQHandler
        B       pass_interrupt_dacs_IRQHandler

        PUBWEAK smif_interrupt_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
smif_interrupt_IRQHandler
        B       smif_interrupt_IRQHandler

        PUBWEAK usb_interrupt_hi_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_hi_IRQHandler
        B       usb_interrupt_hi_IRQHandler

        PUBWEAK usb_interrupt_med_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_med_IRQHandler
        B       usb_interrupt_med_IRQHandler

        PUBWEAK usb_interrupt_lo_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
usb_interrupt_lo_IRQHandler
        B       usb_interrupt_lo_IRQHandler

        PUBWEAK canfd_0_interrupt0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
canfd_0_interrupt0_IRQHandler
        B       canfd_0_interrupt0_IRQHandler

        PUBWEAK canfd_0_interrupts0_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
canfd_0_interrupts0_0_IRQHandler
        B       canfd_0_interrupts0_0_IRQHandler

        PUBWEAK canfd_0_interrupts1_0_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
canfd_0_interrupts1_0_IRQHandler
        B       canfd_0_interrupts1_0_IRQHandler

        PUBWEAK cpuss_interrupts_dw1_29_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
cpuss_interrupts_dw1_29_IRQHandler
        B       cpuss_interrupts_dw1_29_IRQHandler

        PUBWEAK cpuss_interrupts_dw1_30_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
cpuss_interrupts_dw1_30_IRQHandler
        B       cpuss_interrupts_dw1_30_IRQHandler

        PUBWEAK cpuss_interrupts_dw1_31_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
cpuss_interrupts_dw1_31_IRQHandler
        B       cpuss_interrupts_dw1_31_IRQHandler

        PUBWEAK cpuss_interrupts_dw0_29_IRQHandler
        SECTION .text:CODE:REORDER:NOROOT(1)
cpuss_interrupts_dw0_29_IRQHandler
        B       cpuss_interrupts_dw0_29_IRQHandler


        END


; [] END OF FILE
